suzanne_simple_case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField           uniform 0.165687474366; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value      		uniform 0.165687474366; 
    }
	
    outlet
    {
        type            zeroGradient;
    }
    
	monkey
    {
        type            epsilonWallFunction;
        value      		uniform 0.165687474366; 
    }
	
    side
	{
		type			slip;
	}
}


// ************************************************************************* //
