suzanne_simple_case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00147795845331; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00147795845331; 
    }

    outlet
    {
        type            zeroGradient;
    }

    monkey
    {
        type            kqRWallFunction;
        value           uniform 0.00147795845331; 
    }

    side
	{
		type			slip;
	}
}


// ************************************************************************* //
