suzanne_simple_case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField           uniform 112.105637337; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value      		uniform 112.105637337; 
    }

    outlet
    {
        type            zeroGradient;
    }

    monkey
    {
        type            omegaWallFunction;
        value      		uniform 112.105637337; 
    }
	
	side
	{
		type			slip;
	}
}


// ************************************************************************* //
