suzanne_simple_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.25 -0.25 -0.20)
	(0.25 -0.25 -0.20)
	(0.25 0.75 -0.20)
	(-0.25 0.75 -0.20)
	(-0.25 -0.25 0.20)
	(0.25 -0.25 0.20)
	(0.25 0.75 0.20)
	(-0.25 0.75 0.20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 50 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 1 5 4)
		);
	}
	
	outlet
	{
		type patch;
		faces
		(
			(2 3 7 6)
		);
	}
	
	side
	{
		type patch;
		faces
		(
			(4 5 6 7)
			(0 1 2 3)
			(0 3 4 7)
			(1 2 5 6)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
